using NawareKulCore;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace NawareKulCore.Models
{
    public class FamousPeopleViewModel
    {
        public FamousPeopleViewModel()
        {

            ListOfFamousPeople = new List<People> {
                new People { }
            };
        }

        public int MyProperty { get; set; }

        public List<People> ListOfFamousPeople
        {
            get
            {
                return new List<People>() {
                    new People {
                        Name = "नीलकंठ शंकर नवरे (२४/१२/१८९५ ते ८/४/१९८४)",
                        Education = "बी.ए. (ऑनर्स), बी. टी.",
                        Work ="१. सेनापती –सेनापती बापट यांचे चरित्र. \n २. दत्तोवामन पोतदार यांच्यासमवेत सहलेखक म्हुणून ‘मराठी साहित्य परिषदेचा इतिहास’ या ग्रंथाचे लेखन, संपादन.",
                        MainWork = "मराठी कादंबरीकथा, सुभाषितकथा मेघदूतकथा म्हणी अनुभवाच्या खाणी , जीवनातील आनंद प्राप्तीचा राजमार्ग,आदि विविध विषयांवर लेखन",
                        Information = "निधनोत्तर १९८६ साली पुणे महानगरपालिकेच्या वतीने प्रसिद्ध व्यक्ति महणून त्यांच्या राहत्या “योगायोग” बंगल्यावर “नील स्मृतिफलक” लावून त्या रस्त्याचे संस्कृत सुभाषितकार ‘नी. शं. नवरे पथ’ असे आहे.",
                        SrcPath = "/Images/2.JPG"
                    },
                    new People {
                        Name = "क्रियावान पत्रपंडित श्रीपाद शंकर नवरे (३.१०.१९०० ते ६.१२.१९७८)	",
                        Education = "बी.ए. (ऑनर्स)",
                        Work ="संस्थापक आणि प्रथम प्राचार्य, अध्यापक, विद्यालय पनवेल. पुणे विद्यापीठ - बहि:झाल मंडळाचे वाख्याते. संस्कृतचे गाढे अभ्यासक म्हणून पुणे विद्यापीठ,तसेच शारदा मंदिर, पुणे यांच्या वतीने सन्मान, संस्कृत सुभाषितकार म्हणून ख्यातनाम. त्यांनी लिहीलेल्या सुभाषित कथेला महाराष्ट्र शासनाचा प्रथम पुरस्कार. मुंबईतील शंकराचार्य मठाकडून संस्कृतचे अभ्यासक म्हणून पुरस्कार.",
                        MainWork = "श्री.शं.नवरे हे पत्रपंडित म्हणून ओळखले जात ‘संपादक हा वकील नसून न्यायाधीश आहे.’ आपले वर्तमानपत्र कोणत्याही पक्षाचे मुख्यपत्र होता कामा नये. आपली मते व्यक्त करताना निर्भीड व निष्पक्षपणे मांडली पाहिजेत तसेच त्याच्या परिणामामुळे जे सोसावे लागेल ते सोसण्याची तयारी पत्रकाराने ठेवली पाहिजे असा आदर्श पत्रकारितेत निर्माण केला. त्यांनी मुंबईहून प्रसिद्ध होणा-या दै. प्रभात, सा.प्रताप,  दै. केसरी(पुणे)  या ठिकाणी संपादक /उपसंपादक म्हणून ध्येयवादी पत्रकारिता केली .त्यांच्या दै. प्रभात वर्तमानपत्राची ख्याति मृत्युलेखाबद्दल होती. मृत्युलेख हा सामान्यपणे गुणगौरवपर असतो. पण नवरे यांना ज्यांच्यावर मृत्युलेख लिहावयाचा त्यांच्या कार्याचे यथायोग्य मूल्यमापन करण्याची जाणीव पुरेपूर असावयाची. एकदा डॉ. बाबासाहेब आंबेडकर त्यांना ‘प्रभात’ मध्ये भेटावयास गेले असताना “नवरे माझा मृत्युलेख कधी लिहीणार ?” त्यावर श्री. शं. नी “तसा प्रसंग न यावा” अशी इच्छा व्यक्त केली. मात्र ९.१२.१९८६ ला “मौज” च्या अंकात ‘दलितांचा परमेश्वर गुप्त झाला’ या शीर्षकाखाली बाबासाहेबांचे मृत्युलेख लिहिला. माटुंग्याच्या ‘श्रद्धांनंद महिलाश्रम’ या संस्थेच्या स्थापनेपासून ४२ वर्षे त्यांनी निरलस व निस्वार्थपणे सेवा केली,एवढेच नव्हे तर खस्थाही खाल्या.\n आदर्श समाजसेवक ! सच्चे कर्मयोगी ! \n त्याचे ज्येष्ठ बंधु नी.शं. नवरे यांनी त्यांच्यावर लिहिलेले संस्कृत श्लोक प्रसिद्ध आहेत. \n <b>श्री. शं. नवरे तथा पत्न:क्रियावन पत्रपंडित: | \n तेजस्वी च मनस्वी च सर्वेषा च हिते रत: ||१||\n केवलानंद सच्छिष्य: श्रद्धांनंद समन्वित: |\n समाजसेवाको नूनं कर्मयोगं समाचरत ||२||</b>",

                        Information = "निधनोत्तर १९८६ साली पुणे महानगरपालिकेच्या वतीने प्रसिद्ध व्यक्ति महणून त्यांच्या राहत्या “योगायोग” बंगल्यावर “नील स्मृतिफलक” लावून त्या रस्त्याचे संस्कृत सुभाषितकार ‘नी. शं. नवरे पथ’ असे आहे.",
                        SrcPath = "/Images/5.JPG"
                    },
                    new People {
                        Name = "शंकर नारायण नवरे(शन्ना) (२१.११.१९२७ ते २५.०९.२०१३)",
                        Education = "पु. मा. भावे स्मृति पुरस्कार, गदिमा पुरस्कार, वसंत कानेटकर पुरस्कार, लो. टिळक पुरस्कार, झी टीव्हीचा जीवनगौरव पुरस्कार इ.",
                        Work = "",
                        MainWork = "पु. मा. भावे स्मृति पुरस्कार, गदिमा पुरस्कार, वसंत कानेटकर पुरस्कार, लो. टिळक पुरस्कार, झी टीव्हीचा जीवनगौरव पुरस्कार इ.",
                        Information = "पं. महादेवशास्त्री जोशींच्या गोष्टीवेल्हाळपणाची आठवण जागी ठेवणारा लेखक म्हणजे शं. ना. नवरे. लेखन म्हणजे अत्यंत शांत चित्ताने, एकाग्रतेने करण्याची साधना, असा अनेकांचा समज. मात्र त्या समजाला छेद देत \"मला घरीदेखील एकट्याने शांतपणे लिहिता येत नाही, माणसांची सतत चाहूल लागतेच' असं सांगणारे \"शन्ना' सगळ्यांचे लाडके होते. प्रसन्न व्यक्तिमत्त्व, स्वभावातल्या मिश्कीलपणामुळे अधिकच लोकप्रिय. \"शन्नां'ना गोष्टी लिहिण्याइतकीच सांगण्याची अधिक हौस. त्यामुळे कथाकार, कथाकथनकार, नाटककार, पटकथाकार अशा अनेक प्रांतांत त्यांनी यशस्वीपणे मुशाफिरी केली. मला जे भावलं, मी जे अनुभवलं ते मी लिहितो... जे मी अनुभवलंच नाही, त्यावर मला लिहिताच येणार नाही, असं \"शन्ना' म्हणायचे. रोजच्या जगण्यातल्या साध्या साध्या गोष्टी. मात्र त्या त्यांच्याकडून ऐकताना, त्यांच्या पुस्तकातून त्यांच्या पात्रांना भेटताना त्या आपल्यालाही कुठे तरी भेटल्या आहेत, असं वाचकाला सतत वाटतं. भाषा विनाकारण अलंकारिक वा बोजड नाही. त्यामुळेच कदाचित ती वाचकांच्या अधिक जवळ जाणारी. कथा शब्दबंबाळ नसल्या तरीही घटनाप्रधान, आशयप्रधान. माणूस जसा आहे तसा दाखवण्याचा अधिक प्रयत्न त्यांच्याकडून होत असे. खरा-खोटा, योग्य-अयोग्य अशा तात्पर्यांवर न येता त्यांनी वाचकांच्या हृदयालाच हात घातला. \"मनातले कंस', \"अघळपघळ', \"पर्वणी' आदी कथांमधून याची प्रचिती येते. वरवर विनोदी, हलकंफुलकं वाटत असलं, तरी ते काळजाला भिडणारं, एका क्षणी अंतर्मुख करणारं लेखन होतं. साहित्याच्या क्षेत्रात त्यांनी यथेच्छपणे मुशाफिरी केली. त्या त्या साहित्यप्रकाराची, त्याच्या आकृतिबंधाची, त्याच्या सकारात्मक-नकारात्मक अशा बाजूंची पूर्णपणे जाण असल्यामुळेच त्यांना हे सहजी शक्य ही झालं. मुळातच गप्पिष्ट स्वभाव. त्यामुळेच \"शन्नां'चा कथाकथनाचा कार्यक्रम म्हणजे रसिकांना एक साहित्यिक मेजवानीच असे. त्यांच्या कथाच मुळात संवादात्मक. त्यात त्याला अभिनयाची जोड देत केलेलं कथाकथन. त्यामुळे ते ऐकताना \"शन्ना' आणि रसिक यांच्यामध्ये जिवंत संवाद चाले. कथाकार \"शन्नां'ची दुसरी बाजू म्हणजे नाटककार \"शन्ना'. नाटकामध्ये ते अधिक रमत. केवळ लेखनाच्या बाबतीतच नाही, तर बॅकस्टेजपासून नाटक रंगमंचावर येईपर्यंत सगळ्यामध्ये त्यांचा सक्रिय सहभाग. \"धुक्यातत हरवली वाट', \"गुंतता हृदय हे', \"गहिरे रंग' अशा आपल्या अनेक नाटकांत त्याच्या प्रत्येक टप्प्यावर ते गुंतले होते. थिजलेल्या मनांना \"शन्नां'नी त्यांच्या साहित्यातून उभारी दिली. हसत हसत अंतर्मुख केलं. खुसखुशीत शैली, आशयाचं वैविध्य, व्यक्तिरेखांचा ठसठशीतपणा ही \"शन्नां'च्या लेखनाची काही वैशिष्ट्यं. एक प्रसन्न, चतुरस्र, दिलदार साहित्यिक आज आपल्यात नसल्याची उणीव सतत जाणवत राहील. जनसामान्यांचं “शन्नांचं आनंदाचं झाड” काळाच्या पडदयाआड गेलेलं आहे.",
                        SrcPath = "/Images/snnaware.jpg"
                    },
                    new People {
                        Name = "",
                        Education = "",
                        Work = "",
                        MainWork = "",
                        Information = ""
                    }

                };
            }
            set {

            }
        }
    }
}