Repository: Decent-Coder/NawareKul
Catalog: NawareKulCore/Resources/Resource.*.resx
Languages: mr

# AboutKulvruttantTitle
source: About Kulvruttant
mr: कुलवृत्तान्ताविषयी

# About_Description
source: A typical name is identified in any society, except in a family (except in South American customs); They are called 'first names' or 'last names'. Today the people of any family are almost scattered around the world; But during the history, his ancestors lived in a small area of ​​India (in a district of Konkan). From that time, on the basis of historical documents, by making history and genealogy of that family till date, by registering information about the clans in different places; The task of creating a valuable 'kulacem news is that many samajadhurinannim previous generation. Let him add all the information about the family with the photos of the family and the statue The 'Kulvruttant' of that clan has been prepared. Everyone is proud of his family, respect for his ancestors, there is a desire to know the history of the tribe, religious people believe in patriotism, should know about the customs, family, customs and culture of their family / family. Kulvruttant is a 'history of the caste'. Therefore, for which reason people need history, there is also a need for Kulavantata. This priceless possession we received from the ancestors ; And it is our first duty to save the information of the present generations. How can we get it next generation without you? Any Kulvruttant mainly consists of two parts,'Static' - This information is usually not changed for many years. ' And 'dynamic' -In this section, there is a list of all the persons (the dead and the survivor), their relationship, genealogy, as well as those persons from the 'original male' to the present generation, and the list of women and men as per the relations between them. - This information varies from time to time (like). New persons are born, old people are Nirvana, girls of this family get married to Sasari (to another clan); Children get married and come to these families after getting married. This makes new versions of any cosmogonous but it remains the same as 'permanent' form; But the changes in the person and his information become 'changes', and accordingly, the genealogy also changes. For the same reason, a new version of any Koli Dynasty can be removed every year, even after the second day of its release, 'fresh' It is easy to read Kulvruttant in 'Marathi' and 'In English' . But in this case, we should take into account the simplicity of which language of the common people of the language is easy to read. Although some people of the family live overseas, there is no doubt about the vast majority of people living in India. Since 'Kulvruttant' is for everyone in the class , it must be from the mother tongue (from Marathi). Can not show our family organization in the proper form of 'Kulvruttant in English' 'Son, son-in-law, granddaughter, grand daughter-in-law, sister-in-law, father-in-law, sister-in-law, uncle, mama, kaku, mami, mawshi, aata, atoba, vaishoba, panaji, adoptive, adoptive, manasputra, saasurwasin, Mahervasin , Maher, Presharmi, Ghatana, etc. ' Since there are no names in English, they have the option of English to make a new entry. However, there is an alternative to English to write a new language.
mr: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; जगांत कोणत्याही समाजात, एका कुटुंबातील सर्व व्यक्ती (दक्षिण भारतात असलेल्या पद्धतींसारख्या काही प्रथा वगळून) एका ठराविक नावानें ओळखल्या जातात; ज्याला 'कुल-नाम' किंवा 'आडनाव' असें म्हणतात. आज कोणत्याही कुटुंबातील व्यक्ती जवळजवळ जगभर विखुरलेल्या आहेत; परंतु इतिहासकालांत त्यांचे पूर्वज भारतातील एका लहानशा क्षेत्रांत (उदा. कोंकणातील एखाद्या जिल्ह्यांत) रहात होते. त्या काळापासून, ऐतिहासिक कागदपत्रांच्या आधारे, त्या त्या घराण्याचा आजपर्यंतचा इतिहास व वंशावळी तयार करून, त्यांत निरनिराळ्या ठिकाणी रहाणार्‍या कुलबंधूंची माहिती नोंदवून; त्या <u>'कुलाचें वृत्त' तयार करण्याचे बहुमोल कार्य पूर्वीच्या पिढीतील अनेक समाजधुरीणांनीं केलेले आहे.</u> त्याला घराण्यांची, कुलदैवतांच्या फोटोसह कुलाबद्दलच्या सर्व माहितीची जोड देऊन <u>त्या कुलाचे 'कुलवृत्तान्त' तयार झालेले आहेत.</u><br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; प्रत्येकाला आपल्या कुळाचा अभिमान असतो, आपल्या पूर्वजांबद्दल आदर असतो, कुळाचा इतिहास जाणून घेण्याची इच्छा असते, धार्मिक वृत्तीच्या व्यक्तींना कुलदैवतांबद्दल श्रद्धा असते, आपल्या कुलातील /घराण्यातील रीतीरिवाज, सणवार, कुलाचार याची माहिती असावीशी वाटते. <u><b> कुलवृत्तान्त हा 'कुलाचा इतिहास'च आहे.</b></u> म्हणून ज्याकरितां लोकांना इतिहासाची गरज भासते, त्याच कारणाकरितां कुलवृत्तान्ताची देखील गरज आहे. <u>पूर्वजांकडून आपल्याला मिळालेला हा अमूल्य ठेवा आहे</u>; आणि त्याचे जतन करून त्यांत हल्लीच्या पिढ्यांची माहितीची भर टाकणे हें आपले आद्य कर्तव्य आहे. आपण केल्याशिवाय पुढच्या पिढ्यांना हें कसे मिळणार? <br/> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; कोणत्याही कुलवृत्तान्ताचे मुख्यत्वेकरून दोन भाग होतात, <b>'कायम रहाणारा(static)- या माहितीत वर्षानुवर्षे सहसा बदल होत नसतो.' </b>आणि<b> 'बदलणारा(dynamic)'-</b> यांत प्रत्येक घराण्याच्या 'मूळ पुरूषा' पासून आजच्या पिढीपर्यंत सर्व व्यक्ती(मृत व हयात), त्यांचे नातेसंबंध, वंशावळी, त्या व्यक्तींची असेल तेवढी माहिती आणि त्यातून निर्माण होणार्‍या स्त्री-पुरूषांच्या नात्याप्रमाणे याद्या(सूची) यांचा अंतर्भाव आहे. - ही माहिती काळनुरूप (सारखी) बदलत असते. नवीन व्यक्ती जन्माला येतात, वृद्धांचे निर्वाण होते, या कुळातील मुली लग्न होवून सासरी (दुसर्‍या कुळांत) जातात, मुलांचे विवाह होवून नवीन (दुसर्‍या कुळातील) मुली सुना होवून या कुळांत येतात, इ. यामुळे कोणत्याही कुलवृत्तान्ताच्या नवीन आवृत्त्या काढल्या तरी त्यांत 'कायम' स्वरूपाची माहिती आहे तशीच राहते; पण व्यक्ती व त्याच्या माहितीत 'बदल' होतात, आणि त्यानुसार वंशावळी देखील बदलतात.याच कारणामुळे कोणत्याही कुलवृत्तान्ताची नवीन आवृत्ती अगदी दरवर्षी काढली तरी ती काढल्याच्या दुसर्‍या दिवशीसुद्धा तिला 'ताजी' म्हणणे चुकीचे होते. <br/> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; कुलवृत्तान्त <u>'मराठीत' तसेच 'इंग्रजीत'</u> असलेला वाचायला सोपा. पण या बाबतीत आपण हें लक्षांत घ्यायला पाहिजे कीं कुळातल्या सर्वसाधारण व्यक्तींना कोणत्या भाषेंतील कुलवृत्तान्त वाचण्यास सोपा जातो. कुळातील काही जण जरी परदेशीं वास्तव्य करीत असले तरी भारतातच रहाणारे लोक बहुसंख्य आहेत, यांत शंका नाही. 'कुलवृत्तान्त' हा <u>कुलातील सगळ्यांसाठी</u> असल्यानें तो मातृभाषेतूनच (मराठीतून) असायला पाहिजे. 'इंग्रजीतील कुलवृत्तान्त' आपली कुटुंबसंस्था योग्य स्वरूपांत दाखवूं शकत नाहीं. <br/> &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 'सून, जावई, नात, नातसून, नातजावई, सासू, सासरे, वहिनी, मेहुणा, काका,मामा, काकू, मामी, मावशी, आत्या, आतोबा, पणजोबा, पणजी, दत्तक गेलेला, दत्तक आलेला, मानसपुत्र, सासुरवाशीण, माहेरवाशीण, सासर, माहेर, पूर्वाश्रमीची, घराणे, इ.' या नात्यांना इंग्रजीत सुटसुटीत नावेच नसल्याने, (पाश्चात्य संस्कृतीत काका-मामा, काकू-मामी-मावशी, अशा कित्येक नातेसंबंधातला फरकच त्यांच्या ध्यानांत येत नाही) <u>सध्या तरी, नूतन नोंद करण्यासाठी इंग्रजीचा पर्याय उपलब्ध आहे.</u><br/>

# Bharadwajhrushi
source: Bharadwaj rushi
mr: भारद्वाज ऋषी

# Bhardwaj_Desc
source: Naware households are counted as Bharadwaj Kunalpan at 'Karhade' Brahmin branch. Rishi Bharadwaj is a Hindu mythology and one of the sages who are mentioned in the Vedas. He was an ashram near Dandakaranya. They were supplementary. Acharya Bhardwaj explored 600 years ago for his astronomy. Acharya Bharadwaj had done research that could fly from one planet to another, and could not even think of Western researchers such as inventing a plane flying from one universe to another, and flying the aircraft. According to the stories given in Mudgal Purana and Ganesh Purana, Angarak or Mangal is the son of Rishi Bharadwaj
mr: नवरे घराण्याची 'कर्‍हाडे' ब्राम्हण शाखेत भारद्वाज कुलोत्पन्न अशी गणना केली जाते. ऋषी भारद्वाज हे हिंदू पौराणिक कथा आणि वेदांमध्ये उल्लेखलेल्या सप्तर्षींपैकी एक ऋषी आहेत. दंडकारण्याजवळ त्यांचा आश्रम होता. ते आयुर्वेदनिपुण होते. आचार्य भारद्वाज यांनी इ.स.पूर्व ६०० वर्षे विमानशास्त्राविषयी महत्त्वाचे शोध लावले. एका ग्रहावरुन दुसर्‍या ग्रहावर उडणार्‍या व एका विश्वातून दुसर्‍या विश्वात उडणार्‍या विमानांचा शोध, तसेच विमान अदृश्य करणे यांसारखे पाश्चात्त्य संशोधक विचारही करू न शकणारे संशोधन आचार्य भारद्वाज यांनी केले होते. मुद्‌गल पुराण तसेच गणेश पुराण या ग्रंथांत दिलेल्या कथांनुसार, अंगारक किंवा मंगळ हा ऋषी भारद्वाज यांचा पुत्र आहे

# Dhupeshwar
source: Dhopeshwar
mr: धोपेश्वर

# Dhupeshwar_Title
source: Dhopeshwar
mr: धोपेश्वर(धूतपापेश्वर)

source: FamilyTree
mr: वंशावळ

source: Famous Persons
mr: प्रसिद्ध व्यक्ति

# F_Education
source: Education
mr: शिक्षण

# F_Informatio
source: Information
mr: माहिती

# F_MainWork
source: MainWork
mr: प्रमुख ग्रंथसंपदा

# F_Name
source: Name
mr: नाव

# F_Work
source: Work
mr: कार्य

source: Home
mr: मुख्य पानाकडे

source: Naware People
mr: कुळातील व्यक्ति

source: Online Form
mr: ऑनलाइन फॉर्म

source: Prastavna
mr: प्रस्तावना

# Prastavna_Description
source: The concept of 'Kulavruttanta' means 'Family tree' existed in all previous generations (since the discovery of diagnostic printing techniques) existed. The recent findings of print-art as it has been in the past 300-400 years ago. Earlier, there were reports of ancient civilizations such as Indian, Chinese, Egyptian, in many places like copper, stone, on the wall, because it is obvious - the medium used to be available was then used. Due to the absence of any medium since ancient times, the Vedas were preserved in the generation of oral sex. In summary, when the media became easily available, it was being used. When a previous version of any Nobel Prize was published (around or around 1980), 'Internet' was not available; printing had to be printed only if there was only one available medium. Today, the situation has changed in the 21st century, the internet has reached the whole world (even in India's rural areas) and today it is time to make a database through the database on the web, it has been cheaper than print.
mr: 'कुलवृत्तान्त' म्हणजे 'पुस्तक' ही कल्पना पूर्वीच्या सर्व पिढ्यांमध्ये (निदान छपाई कलेचा शोध लागल्यापासून) अस्तित्त्वांत होती. मुद्रण-कलेचा शोध तसा अलीकडला म्हणजे हा फारतर ३००-४०० वर्षांपूर्वीं लागलेला आहे. त्याअगोदर ताम्रपटावर, दगडावर, भिंतीवर, अशा अनेक ठिकाणीं भारतीय, चिनी, इजिप्तशियन अशा प्राचीन संस्कृतींतील इतिहासातील घटना नोंदविलेल्या होत्या- कारण उघड आहे - त्यावेळीं जे माध्यम उपलब्ध होते त्याचा वापर होत गेला. अती-प्राचीन काळापासून कोणतेही माध्यम उपलब्ध नसल्यामुळे 'वेद' हे पिढ्यान पिढ्या मुखोद्गत(मौखिक) स्वरूपांत जतन केले गेले. सारांश काय, त्यावेळीं जें माध्यम सहज उपलब्ध झाले, त्याचा वापर होत गेला. कोणत्याही कुलवृत्तान्ताची पूर्वीची आवृत्ती प्रकशित झाली तेव्हां (इ.स. 1980 च्या सुमारास किंवा त्यापूर्वी) 'इंटरनेट' उपलब्धच नव्हते, मुद्रण हेंच एकमेव माध्यम उपलब्ध असल्यानें, तो छापायलाच लागत होता. आज 21 व्या शतकांत परिस्थिती बदलली आहे, इंटरनेट जगभर (अगदी भारतांत सुद्धा खेडोपाडी) पोहोचलेले आहे आणि आज वेबवर डेटाबेस करून कुलवृत्तान्त करणें, हें तो छापण्यापेक्षां स्वस्त झालेले आहे.

source: User Guide
mr: वापराबद्दल मार्गदर्शिका

# WelcomeText
source: Welcome to Naware Kulvruttant Website
mr: नवरे कुलवृत्तान्ताच्या या संकेतस्थळावर स्वागत आहे

# FamousPeople
source: Famous people in Naware Family
mr: नवरे कुटुंबातील प्रसिद्ध व्यक्तींची माहिती
